tsung/reports/20161117-0042/post-test-4.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
      <server host="www.emergencyinteract-test.zgxk8jxz26.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="15" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="2" unit="minute">
      <users arrivalrate="25" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="15" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="post-test" probability="100" type="ts_http">

      <request>
          <http url="/" method="GET" version="1.1"> </http>
      </request>

      <thinktime value="10" random="true"/>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/events/new" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                         {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                         re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars> 

      <thinktime value="30" random="true"/>

      <request subst="true">
          <http url="/events" method="POST" version="1.1" contents="authenticity_token=%%_authenticity_token%%&amp;event[title]=Test&amp;event[description]=Testing&amp;event[lat]=34.4208&amp;event[long]=119.6982" content_type="application/x-www-form-urlencoded"> </http>
      </request>
    </session>

  </sessions>

</tsung>